[
  {
    "company": "Userful Corporation",
    "designation": "Software Developer",
    "location": "Calgary, AB",
    "start_date": "Apr 2022",
    "end_date": "present",
    "tech_stack": [
      "Quarkus",
      "Java",
      "Python",
      "ReactJS",
      "Javascript",
      "Grafana",
      "Prometheus",
      "Power BI Embedded",
      "Tableau Embedded",
      "Epic System Web Services",
      "PostgreSQL",
      "Vault KV2",
      "OAuth2",
      "JWT"
    ],
    "responsibities": [
      {
        "keyword": "Monitoring and Notifications",
        "description": "Orchestrated the seamless integration of real-time metrics, extracted from DBus signals and methods, into our core product using Quarkus Micrometer, Prometheus, and Grafana v7.5.15. Implemented notifications to alert users when system usage exceeded critical thresholds of 60% and 85%, optimizing resource management and user experience."
      },
      {
        "keyword": "Whitelabelling Grafana",
        "description": "Tailored and whitelabelled Grafana v7.5.15 source code resulting in substantial cost savings of approximately $100,000, circumventing the need for costly OEM licensing."
      },
      {
        "keyword": "LED Media Commander",
        "description": "Leveraged Nvidia SLI Mosaic technology, configuring <kbd>xorg.conf</kbd> to use multiple GPUs to utilize <kbd>seat0</kbd> as a rendering endpoint for stunning 4K output. Successfully integrated Megapixel products, Helios and Omnis, enhancing our platform's capabilities to route 8K content to LED panels and enabling centralized control."
      },
      {
        "keyword": "Integrations",
        "description": "Pioneered the integration of Power BI (auth using OAuth2 code grant), Tableau (auth using Connected Apps), and Epic System Patient Wait Time (auth using OAuth2 client credentials grant) embedding functionalities, elevating our product's data visualization capabilities. All the integrations were designed to use a 'Passport System', managing their credentials centrally and providing persistent logins, facilitating user experience. Empowered users with dynamic insights, fostering a richer understanding of their data and enhancing decision-making processes."
      },
      {
        "keyword": "Security",
        "description": "Elevated security measures by seamlessly integrating HashiCorp's Vault into our product's infrastructure. Fortified protection for critical media sources such as RTSP Streams, VNC and RDP Connections, Tableau, and Power BI, ensuring a resilient and secure environment."
      },
      {
        "keyword": "Backup & Restore",
        "description": "Designed and implemented a backup and restore system encompassing PostgreSQL databases, Vault secrets, and Media files. Engineered a streamlined process for creating, archiving, downloading, uploading, and restoring backups."
      },
      {
        "keyword": "Agile",
        "description": "Actively contributed to continuous improvement through the agile development process. Authored technical documents for new functionalities and APIs, fostering collaboration with stakeholders."
      }
    ]
  },
  {
    "company": "Luxoft",
    "designation": "Consultant",
    "location": "Singapore",
    "start_date": "Oct 2018",
    "end_date": "Dec 2019",
    "tech_stack": ["Bash", "Ant scripts", "Oracle SQL"],
    "responsibities": [
      {
        "keyword": "Market Risk",
        "description": "Played a key role in the technical build of Market Risk for the migration project from Murex version 2.36 to 3.41. Utilized ANT scripts and bash scripts to support the seamless transition, demonstrating proficiency in configuration management and version migration."
      }
    ]
  },
  {
    "company": "Capgemini",
    "designation": "Associate Consultant",
    "location": "Singapore",
    "start_date": "Aug 2017",
    "end_date": "Aug 2018",
    "tech_stack": ["Bash", "Ant scripts", "Oracle SQL"],
    "responsibities": [
      {
        "keyword": "Market Risk",
        "description": "Responsible for technical build of the Market Risk module within MX.3, catering to diverse client requirements and their international entities."
      }
    ]
  },
  {
    "company": "Capgemini",
    "designation": "Associate Consultant",
    "location": "Gurugram, IN",
    "start_date": "Jun 2016",
    "end_date": "Aug 2017",
    "tech_stack": ["Bash", "Ant scripts", "Oracle SQL"],
    "responsibities": [
      {
        "keyword": "Market Risk",
        "description": "Responsible for green field implementation of market risk scenario generation, application, and computations like VaR, Stress Testing, and Back Testing."
      }
    ]
  }
]
